<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
 <HEAD>
   <TITLE> [EasyFlash-devel] Prototypen-Platinen
   </TITLE>
   <LINK REL="Index" HREF="http://lists.berlios.de/pipermail/easyflash-devel/2009-July/index.html" >
   <LINK REL="made" HREF="mailto:easyflash-devel%40lists.berlios.de?Subject=Re%3A%20%5BEasyFlash-devel%5D%20Prototypen-Platinen&In-Reply-To=%3C000601ca063f%24e001c880%246800a8c0%40mhv.webmade.com%3E">
   <META NAME="robots" CONTENT="index,nofollow">
   <style type="text/css">
       pre {
           white-space: pre-wrap;       /* css-2.1, curent FF, Opera, Safari */
           }
   </style>
   <META http-equiv="Content-Type" content="text/html; charset=us-ascii">
   <LINK REL="Previous"  HREF="000071.html">
   <LINK REL="Next"  HREF="000075.html">
 </HEAD>
 <BODY BGCOLOR="#ffffff">
   <H1>[EasyFlash-devel] Prototypen-Platinen</H1>
    <B>Hoffmann-Vetter, Martin</B> 
    <A HREF="mailto:easyflash-devel%40lists.berlios.de?Subject=Re%3A%20%5BEasyFlash-devel%5D%20Prototypen-Platinen&In-Reply-To=%3C000601ca063f%24e001c880%246800a8c0%40mhv.webmade.com%3E"
       TITLE="[EasyFlash-devel] Prototypen-Platinen">martinHV at arcor.de
       </A><BR>
    <I>Thu Jul 16 20:04:33 CEST 2009</I>
    <P><UL>
        <LI>Previous message: <A HREF="000071.html">[EasyFlash-devel] Prototypen-Platinen
</A></li>
        <LI>Next message: <A HREF="000075.html">[EasyFlash-devel] Prototypen-Platinen
</A></li>
         <LI> <B>Messages sorted by:</B> 
              <a href="date.html#73">[ date ]</a>
              <a href="thread.html#73">[ thread ]</a>
              <a href="subject.html#73">[ subject ]</a>
              <a href="author.html#73">[ author ]</a>
         </LI>
       </UL>
    <HR>  
<!--beginarticle-->
<PRE>Hallo,

&gt;&gt;<i> Daher w&#252;rde ich lieber alle Kosten der Prototypenbestellung auf die
</I>&gt;&gt;<i> Beta-Tester umlegen
</I>&gt;<i>
</I>&gt;<i> Klingt sinnvoll. Die 20 bis 25 Euro mit Bauteilen tun sicher keinem
</I>&gt;<i> weh,
</I>&gt;<i> der ernsthaft an seinem Hobby interessiert ist und keiner von uns wird
</I>&gt;<i> noch zus&#228;tzlich belastet.
</I>
Generell w&#252;rde ich das auch als eine kleine &quot;Bestrafung&quot; f&#252;r die Beta-Tester
ansehen. Sie opfern sich schon, mit evtl. Fehler herumschlagen zu m&#252;ssen und
sollen dann auch noch das Projekt finanzieren? Das k&#246;nnte den einen oder
anderen davon abhalten.

Generell w&#252;rde ich die Prototypen als Kosten f&#252;r die Platine ansehen und
auch dort verbuchen. D.h. wenn wir Prototypen bauen lassen, was vermutlich
der beste Weg ist, werden diese Kosten zusammen mit der ersten Bestellung
verrechnet und dann durch die Ausbeute (Anzahl der Platinen in der ersten
Serie und der Prototypen) verteilt. Dann w&#228;re das f&#252;r alle gerecht. Klar
verteuert sich dabei der Komplett-Bausatz oder vielleicht sogar ein
Fertigger&#228;t, jedoch mu&#223; auch gesagt werden, was die Kosten f&#252;r die Platine
sind und was f&#252;r die restlichen (kostenm&#228;&#223;ig vergleichbaren) Bauteile.
Au&#223;erdem handelt es sich hierbei um durch Prototypen gepr&#252;fte Platinen.
Diese Pr&#252;fung beinhaltet auch den Hersteller. Daher bin ich auch daf&#252;r, beim
gleichen Hersteller die Prototypen zu bestellen, wie auch die Serie.

Vielleicht kann man das noch einmal mit Zahlen und bei einer ersten Serie
von 100 St&#252;ck durchspielen. Man k&#246;nnte sogar den worst case mit einer
zweiten Prototypen-Platine durchspielen, was dann auch auf die erste Serie
umgelegt wird.

Eine zweite Serie kann dann (mu&#223; aber nicht) preiswerter werden! Sollte man
eine weitere Revision planen (und so was hatten wir im Hinterkopf) k&#246;nnte
man die &quot;Mehreinnahmen&quot; zur Finanzierung dieser Prototypen verwenden.

&gt;&gt;<i> Die Entscheidung dar&#252;ber w&#252;rde ich davon abh&#228;ngig machen, wie weit
</I>&gt;&gt;<i> der aktuelle Schaltplan vom getesteten F&#228;delaufbau abweicht.
</I>&gt;<i>
</I>&gt;<i> Gar nicht, wenn kein Fehler drin ist.
</I>
Es k&#246;nnten schon Abweichungen auftreten. Evtl. wurden Gatter innerhalb eines
ICs getauscht, FlipFlops im 74LS174, ... Das k&#246;nnte auch Auswirkungen auf
die Schaltung haben. Ich glaube das zwar weniger, m&#246;chte es aber nicht
unerw&#228;hnt lassen.

Klar kann man das alles auch wieder im gef&#228;delten Prototypen ausprobieren.

&gt;&gt;<i> Wenn diese Abweichung klein und nicht grundlegender Natur ist, also
</I>&gt;&gt;<i> eine Funktion der Schaltung erwartet werden kann, w&#252;rde ich
</I>&gt;&gt;<i> vorschlagen,
</I>&gt;&gt;<i> diese 10 Platinen fertigen zu lassen - ansonsten nicht.
</I>&gt;<i>
</I>&gt;<i> Ja, aber noch ein paar Tage warten, bis das Layout &quot;perfekt&quot; ist. Dann
</I>&gt;<i> sollten wir mal im Forum anfragen.
</I>
So sehe ich das auch. Erst mal mu&#223; das Layout richtig stehen. Zur Zeit ist
noch Handlungsbedarf! Aber es macht sich...

Gru&#223; Martin


</PRE>

<!--endarticle-->
    <HR>
    <P><UL>
        <!--threads-->
	<LI>Previous message: <A HREF="000071.html">[EasyFlash-devel] Prototypen-Platinen
</A></li>
	<LI>Next message: <A HREF="000075.html">[EasyFlash-devel] Prototypen-Platinen
</A></li>
         <LI> <B>Messages sorted by:</B> 
              <a href="date.html#73">[ date ]</a>
              <a href="thread.html#73">[ thread ]</a>
              <a href="subject.html#73">[ subject ]</a>
              <a href="author.html#73">[ author ]</a>
         </LI>
       </UL>

<hr>
<a href="https://lists.berlios.de/mailman/listinfo/easyflash-devel">More information about the EasyFlash-devel
mailing list</a><br>
</body></html>
