<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
 <HEAD>
   <TITLE> [EasyFlash-devel] (Layout) Neuer Zwischenstand
   </TITLE>
   <LINK REL="Index" HREF="http://lists.berlios.de/pipermail/easyflash-devel/2009-July/index.html" >
   <LINK REL="made" HREF="mailto:easyflash-devel%40lists.berlios.de?Subject=Re%3A%20%5BEasyFlash-devel%5D%20%28Layout%29%20Neuer%20Zwischenstand&In-Reply-To=%3C002d01ca04b6%244838ee50%241909a8c0%40mhvnb10%3E">
   <META NAME="robots" CONTENT="index,nofollow">
   <style type="text/css">
       pre {
           white-space: pre-wrap;       /* css-2.1, curent FF, Opera, Safari */
           }
   </style>
   <META http-equiv="Content-Type" content="text/html; charset=us-ascii">
   <LINK REL="Previous"  HREF="000046.html">
   <LINK REL="Next"  HREF="000050.html">
 </HEAD>
 <BODY BGCOLOR="#ffffff">
   <H1>[EasyFlash-devel] (Layout) Neuer Zwischenstand</H1>
    <B>Hoffmann-Vetter, Martin</B> 
    <A HREF="mailto:easyflash-devel%40lists.berlios.de?Subject=Re%3A%20%5BEasyFlash-devel%5D%20%28Layout%29%20Neuer%20Zwischenstand&In-Reply-To=%3C002d01ca04b6%244838ee50%241909a8c0%40mhvnb10%3E"
       TITLE="[EasyFlash-devel] (Layout) Neuer Zwischenstand">martinhv at arcor.de
       </A><BR>
    <I>Tue Jul 14 21:07:05 CEST 2009</I>
    <P><UL>
        <LI>Previous message: <A HREF="000046.html">[EasyFlash-devel] (Layout) Neuer Zwischenstand
</A></li>
        <LI>Next message: <A HREF="000050.html">[EasyFlash-devel] (Layout) Neuer Zwischenstand
</A></li>
         <LI> <B>Messages sorted by:</B> 
              <a href="date.html#48">[ date ]</a>
              <a href="thread.html#48">[ thread ]</a>
              <a href="subject.html#48">[ subject ]</a>
              <a href="author.html#48">[ author ]</a>
         </LI>
       </UL>
    <HR>  
<!--beginarticle-->
<PRE>Hallo,

&gt;<i> Eine gute Nachricht: Layout mit 2-Layer ist m&#246;glich.
</I>
Prima, genau das hatten wir auch schon vermutet. Daher freut es mich um so
mehr, da&#223; Du das auch beweisen konntest.

&gt;<i> Habe die Platine jetzt komplett entflechtet und werde mich dann mal an
</I>&gt;<i> die Details machen.
</I>
Und es sieht auf den ersten Blick auch ganz gut aus. Gleichwohl es
sicherlich noch einiges zu tun gibt.

&gt;<i> Der Autorouter hat in mehreren Versuchen nicht unter 160 Vias
</I>&gt;<i> geschafft ;)
</I>
H&#228;tte er es &#252;berhaupt mit zwei Lagen geschafft? Wenn ja, dann bin ich
&#252;berrascht und mu&#223; mir den mal genauer ansehen!

&gt;<i> Den benutze ich um zu testen ob die Positionierung der Bauteile gut
</I>&gt;<i> ist.
</I>
Dazu kann man doch mit Vektoren arbeiten, oder? Zumindest hatte ich das
fr&#252;her so gemacht.

&gt;<i> 1. Alle Leiterbahnen soweit m&#246;glich auf 10mil bringen, wo nicht
</I>&gt;<i> m&#246;glich auf mindestens 8mil.
</I>
Ich h&#228;tte schon sehr gerne alles auf mind. 10 mil. Die Stellen, wo das jetzt
nicht so einfach machbar ist, m&#252;&#223;te man sich noch einmal genauer ansehen und
evtl. umrouten!

&gt;<i> 2. Layout aufr&#228;umen und sch&#246;n machen.
</I>
Ja, das gibt's leider einiges.
* Die Kondensatoren C3 und C6 sind nun parallel geschaltet und daher ist
mind. einer unn&#246;tig. Auch in Hinblick auf C4, welche ich um 90&#176; drehen
w&#252;rde.

&gt;<i> 3. Martins Kommentare abwarten.
</I>
Ach ja, da war doch noch etwas... ;-)

Ich h&#228;tte da noch eine Idee. Mir gef&#228;llt die unteres blaue Ecke nicht so
richtig. Leider kann man die blauen Leiterbahnen auch nicht komplett
einsehen, daher habe ich jetzt eine gewisse Unsicherheit. Aber, ich versuche
das mal:

Die meisten Anschlu&#223;bahnen auf der linken Seite zum RAM sind rot. Daher
vermute ich, da&#223; die Reihenfolge bei den blauen Bahnen nicht immer fest
vorgegeben ist. Daher k&#246;nnte man versuchen, diese so zu sortieren, das die
um die PLCC-Fassungen liegenden oberen blauen Bahnen m&#246;glichst weit links
schon aufh&#246;ren. Die unteren Bahnen k&#246;nnen dann bis zum rechten Rand der
PLCC-Fassung gehen. Damit k&#246;nnte man die Anschlu&#223;bahnen zum U6 direkt nach
oben f&#252;hren und kann sich diesen Knick &#252;ber die unteres rechte Ecke sparen.
Was meinst Du Bj&#246;rn? Des weiteren kann man auch innerhalb des U6 die
passenden D-Eing&#228;nge und Q-Ausg&#228;nge geschickt f&#252;r das Layout passend
tauschen.

Evtl. bekommt man dann f&#252;r den Schalter bzw. Taster ben&#246;tigten Freiraum.

Die Entflechtung um die Widerst&#228;nde f&#252;r den Datenbus finde ich sehr
gelungen. Es w&#228;re sogar eine CR-Version denkbar, wo genau diese Widerst&#228;nde
durch Br&#252;cken im Layout (direkte Verbindung) eingespart werden k&#246;nnen.

Die zwei Leiterbahnen zwischen Pin 6 und 7 des U1 w&#252;rde ich aufheben. Ein
kann zwischen Pin 5 und 6 gelegt werden.

Die Verbindung zwischen Pin 6 und 12 des U7 kann ohne die beiden
Durchkontaktierung auf der roten Seite gelegt werden. Von Pin 6 zwischen Pin
9 und 10 nach oben und dann nach links bis Pin 12. &#196;hnlich mit der Br&#252;cke
zwischen Pin 2 und 9. Von Pin 2 zwischen Pin 12 und 13 nach oben und dann
nach rechts bis Pin 9 in rot.

Dann noch ein weiterer Hinweis: Die h&#246;herwertigen Adre&#223;leitungen (A8-A12,
also Pin 2, 21, 23-25) des RAMs k&#246;nnen auch &#252;ber den Widerstand R1 auf VCC
gelegt werden. Das k&#246;nnte evtl. das Layout vereinfachen, da diese Leitung
bereits als CS2 an Pin 26 anliegt.

Dann noch eine Idee f&#252;r die Abblockkondensatoren der PLCC-Fassungen f&#252;r die
FLASH-Bausteine. Diese 100nF-Kondensatoren gibt es stehend mit langen
Beinen. Daher kann man diese auch kurz unter den Kondensatoren nach au&#223;en um
90&#176; abwinkeln und um damit auf ein RM von 1,5 cm (600 mil) zu kommen. Dann
kann man diese immer rechts neben der FLASHes U3 und U4 setzen.

So damit will ich das vorerst mal belassen, da ich ab jetzt Probleme
bekomme, das obige in der Summe mir als Grafik vorzustellen.

&gt;<i> 4. Mit Thomas &#252;ber Taster und Schalter diskutieren.
</I>
Da halte ich mich jetzt mal raus.

&gt;<i> Aber jetzt mach ich mir mal nen Bier auf.
</I>
Ja, das hast Du Dir auch verdient. Prost!

Gru&#223; Martin


</PRE>

<!--endarticle-->
    <HR>
    <P><UL>
        <!--threads-->
	<LI>Previous message: <A HREF="000046.html">[EasyFlash-devel] (Layout) Neuer Zwischenstand
</A></li>
	<LI>Next message: <A HREF="000050.html">[EasyFlash-devel] (Layout) Neuer Zwischenstand
</A></li>
         <LI> <B>Messages sorted by:</B> 
              <a href="date.html#48">[ date ]</a>
              <a href="thread.html#48">[ thread ]</a>
              <a href="subject.html#48">[ subject ]</a>
              <a href="author.html#48">[ author ]</a>
         </LI>
       </UL>

<hr>
<a href="https://lists.berlios.de/mailman/listinfo/easyflash-devel">More information about the EasyFlash-devel
mailing list</a><br>
</body></html>
