<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
 <HEAD>
   <TITLE> [EasyFlash-devel] (Layout) Neuer Zwischenstand
   </TITLE>
   <LINK REL="Index" HREF="http://lists.berlios.de/pipermail/easyflash-devel/2009-July/index.html" >
   <LINK REL="made" HREF="mailto:easyflash-devel%40lists.berlios.de?Subject=Re%3A%20%5BEasyFlash-devel%5D%20%28Layout%29%20Neuer%20Zwischenstand&In-Reply-To=%3C20090716235739.4ca767cc%40akoya%3E">
   <META NAME="robots" CONTENT="index,nofollow">
   <style type="text/css">
       pre {
           white-space: pre-wrap;       /* css-2.1, curent FF, Opera, Safari */
           }
   </style>
   <META http-equiv="Content-Type" content="text/html; charset=us-ascii">
   <LINK REL="Previous"  HREF="000082.html">
   <LINK REL="Next"  HREF="000084.html">
 </HEAD>
 <BODY BGCOLOR="#ffffff">
   <H1>[EasyFlash-devel] (Layout) Neuer Zwischenstand</H1>
    <B>Thomas Giesel</B> 
    <A HREF="mailto:easyflash-devel%40lists.berlios.de?Subject=Re%3A%20%5BEasyFlash-devel%5D%20%28Layout%29%20Neuer%20Zwischenstand&In-Reply-To=%3C20090716235739.4ca767cc%40akoya%3E"
       TITLE="[EasyFlash-devel] (Layout) Neuer Zwischenstand">skoe at directbox.com
       </A><BR>
    <I>Thu Jul 16 23:57:39 CEST 2009</I>
    <P><UL>
        <LI>Previous message: <A HREF="000082.html">[EasyFlash-devel] (Layout) Neuer Zwischenstand
</A></li>
        <LI>Next message: <A HREF="000084.html">[EasyFlash-devel] (Layout) Neuer Zwischenstand
</A></li>
         <LI> <B>Messages sorted by:</B> 
              <a href="date.html#83">[ date ]</a>
              <a href="thread.html#83">[ thread ]</a>
              <a href="subject.html#83">[ subject ]</a>
              <a href="author.html#83">[ author ]</a>
         </LI>
       </UL>
    <HR>  
<!--beginarticle-->
<PRE>
Erstmal: Super, dass ihr das mit dem Layout so toll hinbekommt. Hab
jetzt erstmal genauer hingesehen: Der Strichcode ist ja verschwunden!

Ich wei&#223;, ihr habt andere Sorgen, trotzdem m&#246;chte ich es schonmal
ansprechen:

Alex und ich haben schon dar&#252;ber gesprochen und es
gab auch Zuspruch von anderer Seite: Ich m&#246;chte alles, was mit
EasyFlash zu tun hat, &#252;ber eine Internet-Seite erreichbar machen. Es
soll nicht so sein, dass man sich die Infos &#252;berall zusammensuchen muss.

Deshalb hat Alex den Link schon in den Browser eingebaut, kannst Du
den bitte auch auf den B-Druck schreiben, wenn Du Platz findest:
skoe.de/easyflash

Tschuldigung, dass da mein Name drinsteht, eine eigene Domain m&#246;chte
ich nicht daf&#252;r kaufen. Aber dort wird es auch eine
&quot;Danksagungen&quot;-Seite geben.

Sch&#246;n w&#228;re es auch, wenn wir das offizielle Logo unterbringen k&#246;nnten,
siehe Dateianhang. In welchem Dateiformat k&#246;nnte Dir das was nutzen,
Bj&#246;rn?

&gt;<i> Ja, bei Kessler der UM62M256-15 f&#252;r 3,73 EUR das St&#252;ck. Aber ich
</I>&gt;<i> glaube kaum, da&#223; man den dort kaufen m&#246;chte.
</I>
Besonders, weil der 6264 nur 1,30 kostet :-)

&gt;<i> Herz f&#252;r die Bastler, welche nur die Platine kaufen und dann die
</I>&gt;<i> restlichen Teile noch zu Hause in Bastelkisten haben.
</I>
Das k&#246;nnte allerdings sein. Das wird vermutlich die Minderheit sein.

&gt;<i> Demnach k&#246;nnte Nils sp&#228;ter auch einen
</I>&gt;<i> HC-Bausatz (Hardcore) nur mit Platine inkl. passenden Taster und
</I>&gt;<i> Schalter und den FLASH-Bausteinen anbieten. Ich w&#252;rde sowas kaufen.
</I>
Da hast Du ja auch genau die teuren Teile aufgez&#228;hlt. Der Rest (RAM,
Logik, Rs, Cs) kostet etwa 2,50.

Nils und ich haben schon ein bisschen dar&#252;ber philosophiert: Vielleicht
nur Leiterplatte, LP+Bauteile, LP+Bauteile+Geh&#228;use. Extraw&#252;rste m&#246;chte
er vermeiden (&quot;PLCC-Sockel habe ich noch, aber die Flashs brauche ich,
bekomme ich den Bausatz 40 Cent billiger?&quot;) - Das kann ich
nachvollziehen.

Der HC-Bausatz ist im Ansatz nicht schlecht, aber der w&#252;rde halt genau
zu solchen Effekten f&#252;hren, denn jeder hat was anderes in der
Bastelkiste.

&gt;<i> Okay, vielleicht sollte ich nicht von mich auf andere schlie&#223;en. ;-)
</I>
Nun ja, dazu neigen wir alle mal. Deshalb habe ich ja auch den
Reset-Taster und den Schalter von mir als SW-Entwickler auf andere
projiziert :-)

&gt;<i> Eine andere M&#246;glichkeit w&#228;re f&#252;r den Schalter ein REED-Kontakt. Dann
</I>&gt;<i> mu&#223; man eben einen Magneten zum Programmieren auf das Modul legen!
</I>
Mhh, fr&#252;her musste man den immer zum L&#246;schen &#252;ber die Disketten
schieben, heute kann man damit schon programmieren ;-) So &#228;ndern sich
die Zeiten :-)

&gt;<i> Aber ich denke, dies macht sich mit einem Modulgeh&#228;use in der Hand
</I>&gt;<i> etwas besser. Ich habe leider keines!
</I>
Kommste wiedermal mal vorbei, ich hab 5 St&#252;ck hier. Was ich sagen kann:
&#220;ber der Leiterplatte ist 9 mm Platz bis zum Deckel, die Leiterplatte
f&#252;llt die Fl&#228;che bis auf links und rechts zwischen den Nasen fast
vollst&#228;ndig aus.

/Thomas
-------------- next part --------------
A non-text attachment was scrubbed...
Name: easyloader.png
Type: image/png
Size: 4753 bytes
Desc: not available
URL: &lt;<A HREF="https://lists.berlios.de/pipermail/easyflash-devel/attachments/20090716/92093839/attachment.png">https://lists.berlios.de/pipermail/easyflash-devel/attachments/20090716/92093839/attachment.png</A>&gt;
</PRE>

<!--endarticle-->
    <HR>
    <P><UL>
        <!--threads-->
	<LI>Previous message: <A HREF="000082.html">[EasyFlash-devel] (Layout) Neuer Zwischenstand
</A></li>
	<LI>Next message: <A HREF="000084.html">[EasyFlash-devel] (Layout) Neuer Zwischenstand
</A></li>
         <LI> <B>Messages sorted by:</B> 
              <a href="date.html#83">[ date ]</a>
              <a href="thread.html#83">[ thread ]</a>
              <a href="subject.html#83">[ subject ]</a>
              <a href="author.html#83">[ author ]</a>
         </LI>
       </UL>

<hr>
<a href="https://lists.berlios.de/mailman/listinfo/easyflash-devel">More information about the EasyFlash-devel
mailing list</a><br>
</body></html>
