<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
 <HEAD>
   <TITLE> [EasyFlash-devel] (Layout) Neuer Zwischenstand
   </TITLE>
   <LINK REL="Index" HREF="http://lists.berlios.de/pipermail/easyflash-devel/2009-July/index.html" >
   <LINK REL="made" HREF="mailto:easyflash-devel%40lists.berlios.de?Subject=Re%3A%20%5BEasyFlash-devel%5D%20%28Layout%29%20Neuer%20Zwischenstand&In-Reply-To=%3C20090715233606.257591e6%40akoya%3E">
   <META NAME="robots" CONTENT="index,nofollow">
   <style type="text/css">
       pre {
           white-space: pre-wrap;       /* css-2.1, curent FF, Opera, Safari */
           }
   </style>
   <META http-equiv="Content-Type" content="text/html; charset=us-ascii">
   <LINK REL="Previous"  HREF="000059.html">
   <LINK REL="Next"  HREF="000065.html">
 </HEAD>
 <BODY BGCOLOR="#ffffff">
   <H1>[EasyFlash-devel] (Layout) Neuer Zwischenstand</H1>
    <B>Thomas Giesel</B> 
    <A HREF="mailto:easyflash-devel%40lists.berlios.de?Subject=Re%3A%20%5BEasyFlash-devel%5D%20%28Layout%29%20Neuer%20Zwischenstand&In-Reply-To=%3C20090715233606.257591e6%40akoya%3E"
       TITLE="[EasyFlash-devel] (Layout) Neuer Zwischenstand">skoe at directbox.com
       </A><BR>
    <I>Wed Jul 15 23:36:06 CEST 2009</I>
    <P><UL>
        <LI>Previous message: <A HREF="000059.html">[EasyFlash-devel] (Layout) Neuer Zwischenstand
</A></li>
        <LI>Next message: <A HREF="000065.html">[EasyFlash-devel] (Layout) Neuer Zwischenstand
</A></li>
         <LI> <B>Messages sorted by:</B> 
              <a href="date.html#64">[ date ]</a>
              <a href="thread.html#64">[ thread ]</a>
              <a href="subject.html#64">[ subject ]</a>
              <a href="author.html#64">[ author ]</a>
         </LI>
       </UL>
    <HR>  
<!--beginarticle-->
<PRE>
Hallo,

&gt;<i> Das mit den SIL Netzwerken hatte ich am Anfang schon probiert, war
</I>&gt;<i> nicht soo schick wegen der DuKos.
</I>
Ich erinnere mich. Aber das Problem kann ich nicht nachvollziehen. Kann
man das nicht so in der Richtung machen wie im Anhang? Das habe ich nur
mal ganz grob zurechtgezimmert, die Winkel kann man ja noch etwas
anders w&#228;hlen. Das sind auf die Schnelle 45 mil Vias statt Pads, aber Du
wei&#223;t sicher, was ich meine. 

Der Datenbus auf der Unterseite passt genauso durch wie jetzt.

Vom Preis her nimmt es sich nicht viel, vielleicht 5 Cent hin oder her,
ich wei&#223; nicht mal, in welche Richtung. Aber so ein schwarzer Riegel
(oder 2) sieht halt ganz knuffig aus und ist zudem f&#252;r Anf&#228;nger auch
leichter zu fixieren als 8 gebogene Widerst&#228;nde direkt nebeneinander.
Aber ich bestehe wirklich nicht drauf :-)

&gt;<i> M&#246;glicherweise ist es sinnvoll, wenn f&#252;r Prototypen bereits Platinen
</I>&gt;<i> vom industriellen Fertiger kommen sollen, diese dort zu ordern, wo
</I>&gt;<i> sie sp&#228;ter auch &quot;f&#252;r die Massen&quot; hergestellt werden sollen - das
</I>&gt;<i> spart ggfs. Einrichtungskosten.
</I>
Das w&#252;rde ich auch machen, aber ich sag's mal ganz direkt: Bis jetzt
habe ich sicher schon 100 oder 200 Euro in die Sache gesteckt. Schon
eine der Lochrasterplatinen kostet 6 Euro, dazu noch einige Bauteile,
darunter einige Fehlk&#228;ufe wg. &#196;nderungen, Geh&#228;use, Werkzeuge.. Sicher,
viele dieser Dinge kann man sp&#228;ter wieder gebrauchen, aber jetzt liegen
sie erstmal im Regel.

Gern w&#252;rde ich die Leiterplatten gleich richtig bestellen, aber unter
50 Euro ist (f&#252;r mich) da absolut nichts zu machen.

Wenn wir gleich von Anfang an die richtigen Leiterplatten bestellen
w&#252;rden, fr&#246;gte ich Dich, ob Du das machen k&#246;nntest und die
Einmalkosten, die Du ja dann sp&#228;ter sparst, dann mit auf die Baus&#228;tze
aufteilen w&#252;rdest.

Seit mir nicht b&#246;se, aber ich muss aufpassen, dass das Hobby nicht zu
sehr in's Geld geht.

&gt;<i> Tut mir leid das ich jetzt Pl&#228;ne rausgegeben habe. War
</I>&gt;<i> nicht meine Absicht.
</I>
F&#252;r mich ist das kein Problem - eher tendiere ich sogar lieber dazu,
alles zu ver&#246;ffentlichen. Nur mit R&#252;cksicht auf Nils hatte ich das
angemerkt. Den Vorschlag, das Layout erst nach ein paar Monaten zu
ver&#246;ffentlichen, oder wann immer Nils seinen Break Even erreicht hat,
finde ich akzeptabel. W&#228;re schade, wenn er 100 Leiterplatten kauft und
irgendjemand parallel dazu eine Sammelbestellung macht oder so.

Der Schaltplan und die Software bleiben offen, wenn jemand Arbeit
reinsteckt (!), kann er damit auch (fast) machen, was er will.

Aus dem Archiv habe ich die Mail erstmal gel&#246;scht. Die Eagle-Version
des Schaltplans (und erstmal nicht des Layouts) w&#252;rde ich schonmal in's
Quelltextrepository &#252;bernehmen. Das ist auch &#246;ffentlich.
<A HREF="http://hg.berlios.de/repos/easyflash">http://hg.berlios.de/repos/easyflash</A>
Mit &quot;zip&quot; u.&#228;. kann man sich den aktuellen Stand runterladen, mit
&quot;files&quot; kann man in den Dateien graben.

&gt;<i> Ich war eigentlich der Ansicht das die Mailinglist die sich ja auch
</I>&gt;<i> [devel] nennt nur f&#252;r den kleinen Kreis
</I>&gt;<i> verf&#252;gbar ist.
</I>
Es kann sich jeder so einfach registrieren wie Du. Und die Archive sind
&#246;ffentlich zug&#228;nglich. Normalerweise bei einem OpenSource-Projekt auch
die Voreinstellung :-)

&gt;<i> Urheber Thomas Giesel
</I>
Wie ich vom Sauhund gelernt habe: Der Urheber des Layouts bist und
bleibst Du, das kann keiner &#228;ndern. Aber Du kannst mir die
Nutzungsrechte &#252;bertragen ;-) 

&gt;<i> Er will sicherlich nicht 62 Durchkontaktierungen von Hand machen.
</I>&gt;<i> Falls doch, m&#246;chte ich noch erw&#228;hnen das fast alle Pads
</I>&gt;<i> von oben UND unten gel&#246;tet werden m&#252;ssen.
</I>
Da hast Du recht, dass will ich wahrlich nicht.

Wenn keiner eine bessere Idee hat oder die Platinen sponsorn m&#246;chte,
w&#252;rde ich doch 2 St&#252;ck &quot;ohne alles&quot; - also ohne L&#246;tstopp und ohne
B-Druck - bestellen. Das w&#252;rde 25 Euro kosten und w&#228;re allemal besser
als selbstgemacht. Die 2 Wochen Wartezeit w&#252;rde ich auf alle F&#228;lle noch
sinnvoll f&#252;llen k&#246;nnen. Die Software blieb in den letzten Wochen
ziemlich liegen...

In dem Fall sollte Nils nach erfolgreichen Tests trotzdem vom
endg&#252;ltigen Lieferanten ein paar Samples ordern. 

Und ich erinnere: Die Prototypen dienen auch dazu, die Schaltung auf
anderen Rechnern au&#223;er meinen beiden zu testen. Im schlimmsten Fall
k&#246;nnte sich sogar noch die Schaltung &#228;ndern! Das halte ich allerdings
f&#252;r unwahrscheinlich.

Gru&#223;,

Thomas
-------------- next part --------------
A non-text attachment was scrubbed...
Name: easyflash.png
Type: image/png
Size: 20897 bytes
Desc: not available
URL: &lt;<A HREF="https://lists.berlios.de/pipermail/easyflash-devel/attachments/20090715/2c264087/attachment.png">https://lists.berlios.de/pipermail/easyflash-devel/attachments/20090715/2c264087/attachment.png</A>&gt;
</PRE>

<!--endarticle-->
    <HR>
    <P><UL>
        <!--threads-->
	<LI>Previous message: <A HREF="000059.html">[EasyFlash-devel] (Layout) Neuer Zwischenstand
</A></li>
	<LI>Next message: <A HREF="000065.html">[EasyFlash-devel] (Layout) Neuer Zwischenstand
</A></li>
         <LI> <B>Messages sorted by:</B> 
              <a href="date.html#64">[ date ]</a>
              <a href="thread.html#64">[ thread ]</a>
              <a href="subject.html#64">[ subject ]</a>
              <a href="author.html#64">[ author ]</a>
         </LI>
       </UL>

<hr>
<a href="https://lists.berlios.de/mailman/listinfo/easyflash-devel">More information about the EasyFlash-devel
mailing list</a><br>
</body></html>
