<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
 <HEAD>
   <TITLE> [EasyFlash-devel] Prototypen-Platinen
   </TITLE>
   <LINK REL="Index" HREF="http://lists.berlios.de/pipermail/easyflash-devel/2009-July/index.html" >
   <LINK REL="made" HREF="mailto:easyflash-devel%40lists.berlios.de?Subject=Re%3A%20%5BEasyFlash-devel%5D%20Prototypen-Platinen&In-Reply-To=%3C0F8C07D907100F13003B5%40directbox.com%3E">
   <META NAME="robots" CONTENT="index,nofollow">
   <style type="text/css">
       pre {
           white-space: pre-wrap;       /* css-2.1, curent FF, Opera, Safari */
           }
   </style>
   <META http-equiv="Content-Type" content="text/html; charset=us-ascii">
   <LINK REL="Previous"  HREF="000079.html">
   <LINK REL="Next"  HREF="000073.html">
 </HEAD>
 <BODY BGCOLOR="#ffffff">
   <H1>[EasyFlash-devel] Prototypen-Platinen</H1>
    <B>Thomas Giesel</B> 
    <A HREF="mailto:easyflash-devel%40lists.berlios.de?Subject=Re%3A%20%5BEasyFlash-devel%5D%20Prototypen-Platinen&In-Reply-To=%3C0F8C07D907100F13003B5%40directbox.com%3E"
       TITLE="[EasyFlash-devel] Prototypen-Platinen">skoe at directbox.com
       </A><BR>
    <I>Thu Jul 16 17:19:00 CEST 2009</I>
    <P><UL>
        <LI>Previous message: <A HREF="000079.html">[EasyFlash-devel] (Layout) Neuer Zwischenstand
</A></li>
        <LI>Next message: <A HREF="000073.html">[EasyFlash-devel] Prototypen-Platinen
</A></li>
         <LI> <B>Messages sorted by:</B> 
              <a href="date.html#71">[ date ]</a>
              <a href="thread.html#71">[ thread ]</a>
              <a href="subject.html#71">[ subject ]</a>
              <a href="author.html#71">[ author ]</a>
         </LI>
       </UL>
    <HR>  
<!--beginarticle-->
<PRE>Tach,

&gt;<i> Es w&#252;rde den Vorgang wahrscheinlich 
</I>&gt;<i> vereinfachen, bei ein und dem selben Hersteller erst wenige, dann mehr 
</I>&gt;<i> des gleichen oder eines &#228;hnlichen Layouts zu bestellen.
</I>
Das ist wahrscheinlich.

&gt;<i> Daher w&#252;rde ich lieber alle Kosten der Prototypenbestellung auf die 
</I>&gt;<i> Beta-Tester umlegen
</I>
Klingt sinnvoll. Die 20 bis 25 Euro mit Bauteilen tun sicher keinem weh,
der ernsthaft an seinem Hobby interessiert ist und keiner von uns wird
noch zus&#228;tzlich belastet.

&gt;<i> Der anvisierte Bausatz-Verkaufs-Preis, den wir besprochen haben, ist
</I>&gt;<i> ohnehin so knapp kalkuliert
</I>
Wenn der mit Versandkosten ist, stimmt das. Ansonsten nicht knapp, sondern
realistisch.

&gt;<i> dass darin keine Reserve enthalten ist, solche Entwicklungskosten 
</I>&gt;<i> aufzufangen.
</I>
Ach so hast Du das gemeint. Na dass stimmt. Wenn man die Entwicklungskosten 
tats&#228;chlich berechnen w&#252;rde, w&#228;ren wir sicher schon im vierstelligen Bereich, 
aber lasse ich mal das alberne Zahlenspiel. Zum Gl&#252;ck ist es ja Open Source :-)
Das gleiche mit den Kosten gilt nat&#252;rlich auch f&#252;r Deine wertvollen Stunden...

&gt;<i> daf&#252;r erhalten sie aber auch vor der &quot;breiten Masse&quot; einige Zeit fr&#252;her ein
</I>&gt;<i> Exemplar und d&#252;rfen sich als Mitglied der Entwicklermannschaft f&#252;hlen.
</I>
Mhh, und eins habe ich damals Alex versprochen, f&#252;r den Browser. Das muss
ich wohl an dieser Stelle einl&#246;sen :-) Eins w&#252;rde ich einem anderen Entwickler
zukommen lassen, aber vielleicht w&#252;rde der das auch selbst finanzieren.

Danke auf alle F&#228;lle f&#252;r das Angebot, das zu organisieren (wenn's ein solches war).

&gt;<i> 15 Euro sind deutlich weniger als 25 Euro
</I>
Das waren 25 Euro f&#252;r 2 Platinen. Aber Dein Vorschlag klingt wesentlich 
verlockender, weil er mit &quot;Nebenkosten&quot; ist und Komplett-Platinen.

Hast Du inzwischen mal nachgesehen, was eine Platine bei 60 bis 100 St&#252;ck
kosten w&#252;rde, wenn Du sie billigst einkaust, ggfs. ohne Tooling-Kosten, wenn
der Prototyp unver&#228;ndert bleibt? D&#252;rften deutlich unter 3 Euro sein,
oder?

Wie machen wir das mit den Bauteilen? Ich habe noch h&#246;chstens 5 Satz zuhause,
wahrscheinlich auch nicht komplett.

&gt;<i> Die Entscheidung dar&#252;ber w&#252;rde ich davon abh&#228;ngig machen, wie weit der 
</I>&gt;<i> aktuelle Schaltplan vom getesteten F&#228;delaufbau abweicht.
</I>
Gar nicht, wenn kein Fehler drin ist.

&gt;<i> Wenn diese Abweichung klein und nicht grundlegender Natur ist, also eine 
</I>&gt;<i> Funktion der Schaltung erwartet werden kann, w&#252;rde ich vorschlagen, 
</I>&gt;<i> diese 10 Platinen fertigen zu lassen - ansonsten nicht.
</I>
Ja, aber noch ein paar Tage warten, bis das Layout &quot;perfekt&quot; ist. Dann
sollten wir mal im Forum anfragen.

@Bj&#246;rn: Wird ja immer &#252;bersichtlicher, sch&#246;n!

Gru&#223;,

Thomas



</PRE>

<!--endarticle-->
    <HR>
    <P><UL>
        <!--threads-->
	<LI>Previous message: <A HREF="000079.html">[EasyFlash-devel] (Layout) Neuer Zwischenstand
</A></li>
	<LI>Next message: <A HREF="000073.html">[EasyFlash-devel] Prototypen-Platinen
</A></li>
         <LI> <B>Messages sorted by:</B> 
              <a href="date.html#71">[ date ]</a>
              <a href="thread.html#71">[ thread ]</a>
              <a href="subject.html#71">[ subject ]</a>
              <a href="author.html#71">[ author ]</a>
         </LI>
       </UL>

<hr>
<a href="https://lists.berlios.de/mailman/listinfo/easyflash-devel">More information about the EasyFlash-devel
mailing list</a><br>
</body></html>
