<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
 <HEAD>
   <TITLE> [EasyFlash-devel] Prototypen-Platinen
   </TITLE>
   <LINK REL="Index" HREF="http://lists.berlios.de/pipermail/easyflash-devel/2009-July/index.html" >
   <LINK REL="made" HREF="mailto:easyflash-devel%40lists.berlios.de?Subject=Re%3A%20%5BEasyFlash-devel%5D%20Prototypen-Platinen&In-Reply-To=%3C4A5F3710.6040800%40gmx.de%3E">
   <META NAME="robots" CONTENT="index,nofollow">
   <style type="text/css">
       pre {
           white-space: pre-wrap;       /* css-2.1, curent FF, Opera, Safari */
           }
   </style>
   <META http-equiv="Content-Type" content="text/html; charset=us-ascii">
   <LINK REL="Previous"  HREF="000065.html">
   <LINK REL="Next"  HREF="000060.html">
 </HEAD>
 <BODY BGCOLOR="#ffffff">
   <H1>[EasyFlash-devel] Prototypen-Platinen</H1>
    <B>Nils Eilers</B> 
    <A HREF="mailto:easyflash-devel%40lists.berlios.de?Subject=Re%3A%20%5BEasyFlash-devel%5D%20Prototypen-Platinen&In-Reply-To=%3C4A5F3710.6040800%40gmx.de%3E"
       TITLE="[EasyFlash-devel] Prototypen-Platinen">nils.eilers at gmx.de
       </A><BR>
    <I>Thu Jul 16 16:20:00 CEST 2009</I>
    <P><UL>
        <LI>Previous message: <A HREF="000065.html">[EasyFlash-devel] (Layout) Neuer Zwischenstand
</A></li>
        <LI>Next message: <A HREF="000060.html">[EasyFlash-devel] (Layout) Neuer Zwischenstand
</A></li>
         <LI> <B>Messages sorted by:</B> 
              <a href="date.html#69">[ date ]</a>
              <a href="thread.html#69">[ thread ]</a>
              <a href="subject.html#69">[ subject ]</a>
              <a href="author.html#69">[ author ]</a>
         </LI>
       </UL>
    <HR>  
<!--beginarticle-->
<PRE>&gt;<i> Gern w&#252;rde ich die Leiterplatten gleich richtig bestellen, aber unter
</I>&gt;<i> 50 Euro ist (f&#252;r mich) da absolut nichts zu machen.
</I>
&gt;<i> Wenn wir gleich von Anfang an die richtigen Leiterplatten bestellen
</I>&gt;<i> w&#252;rden, fr&#246;gte ich Dich, ob Du das machen k&#246;nntest und die
</I>&gt;<i> Einmalkosten, die Du ja dann sp&#228;ter sparst, dann mit auf die Baus&#228;tze
</I>&gt;<i> aufteilen w&#252;rdest.
</I>&gt;<i> 
</I>&gt;<i> Seit mir nicht b&#246;se, aber ich muss aufpassen, dass das Hobby nicht zu
</I>&gt;<i> sehr in's Geld geht.
</I>
&gt;<i> Wenn keiner eine bessere Idee hat oder die Platinen sponsorn m&#246;chte,
</I>&gt;<i> w&#252;rde ich doch 2 St&#252;ck &quot;ohne alles&quot; - also ohne L&#246;tstopp und ohne
</I>&gt;<i> B-Druck - bestellen. Das w&#252;rde 25 Euro kosten und w&#228;re allemal besser
</I>&gt;<i> als selbstgemacht. Die 2 Wochen Wartezeit w&#252;rde ich auf alle F&#228;lle noch
</I>&gt;<i> sinnvoll f&#252;llen k&#246;nnen. Die Software blieb in den letzten Wochen
</I>&gt;<i> ziemlich liegen...
</I>
&gt;<i> In dem Fall sollte Nils nach erfolgreichen Tests trotzdem vom
</I>&gt;<i> endg&#252;ltigen Lieferanten ein paar Samples ordern. 
</I>
Ich kann Dich gut verstehen, wer mu&#223; nicht auf sein Geld achten?
Ich betrachte auch mit Staunen und einer Mischung aus Furcht und 
Zuversicht die immer gr&#246;&#223;er werdenden Zahlen meiner Auslagen...

Folgende &#220;berlegungen und Vorschlag:

- zwei Prototypen w&#252;rden reichen, um das Design grunds&#228;tzlich zu testen. 
Besser w&#228;ren 10, die von entsprechend mehr Paar Augen, Sichtweisen, 
Herangehensweisen, Hardwareausstattungen etc. begutachtet werden w&#252;rden.

- Wenn wir zwei Platinen irgendwo ohne alles bestellen und dann woanders 
durch jemand anders ein paar &quot;Samples&quot; ordern, fangen wir aus Sicht der 
Bestellung wieder am Anfang an. Es w&#252;rde den Vorgang wahrscheinlich 
vereinfachen, bei ein und dem selben Hersteller erst wenige, dann mehr 
des gleichen oder eines &#228;hnlichen Layouts zu bestellen.

- Die Umrechnung der Einmalkosten auf die Baus&#228;tze w&#252;rde konkret 
bedeuten, dass die Auslagen nicht Du tr&#228;gst, sondern ich und das bei 10 
statt 2 Platinen gleich in mehrfacher H&#246;he. Nicht nur, dass sich das 
sehr wenig verlockend anh&#246;rt, ist auch die Berechnung extrem schwierig, 
da von vornerein niemand sagen kann, ob wir das Layout direkt &#252;bernehmen 
k&#246;nnen (weil alles super ist) und damit Tooling-Kosten sparen - oder ob 
&#196;nderungen notwendig werden und damit erneute Kosten anfallen, d.h. die 
Auslagen aus mehreren Prototypen-Bestellungen erst von mir vorgestreckt 
und dann auf die Baus&#228;tze umgelegt werden m&#252;ssen.

Daher w&#252;rde ich lieber alle Kosten der Prototypenbestellung auf die 
Beta-Tester umlegen, so dass am Ende keine Auslagen &#252;brig bleiben, die 
auf die Baus&#228;tze umgelegt werden m&#252;ssen. Der anvisierte 
Bausatz-Verkaufs-Preis, den wir besprochen haben, ist ohnehin so knapp 
kalkuliert, dass darin keine Reserve enthalten ist, solche 
Entwicklungskosten aufzufangen.
Beim VC20 Final Expansion handhaben wir das auch so, dass die 
Beta-Tester die etwas h&#246;heren Kosten des Beta-Tests tragen -- daf&#252;r 
erhalten sie aber auch vor der &quot;breiten Masse&quot; einige Zeit fr&#252;her ein 
Exemplar und d&#252;rfen sich als Mitglied der Entwicklermannschaft f&#252;hlen.

Bei Abnahme von 10 Exemplaren w&#252;rde eine Platine im Luftpolsterumschlag 
verschickt jeden einzelnen dieser 10 Leute 15,20 Euro kosten - inklusive 
aller Kosten f&#252;r Tooling, Fertigung, Versand, Einfuhrumsatzsteuer, 
Luftpolsterumschlag und nationalem innerdeutschem Porto.

15 Euro sind deutlich weniger als 25 Euro, jeder h&#228;tte eine 
doppelseitige, durchkontaktierte Platine mit beidseitig L&#246;tstopplack und 
Best&#252;ckungsdruck - und wir h&#228;tten 10 Tester, die mehr testen k&#246;nnen als 
2 Tester.

Die Entscheidung dar&#252;ber w&#252;rde ich davon abh&#228;ngig machen, wie weit der 
aktuelle Schaltplan vom getesteten F&#228;delaufbau abweicht. Leider kann ich 
die Schaltung des Easyflashs aus Zeitgr&#252;nden momentan nicht so intensiv 
verfolgen, wie ich das gerne w&#252;rde - daher wei&#223; ich nicht, in wie weit 
das der Fall ist.
Wenn diese Abweichung klein und nicht grundlegender Natur ist, also eine 
Funktion der Schaltung erwartet werden kann, w&#252;rde ich vorschlagen, 
diese 10 Platinen fertigen zu lassen - ansonsten nicht.

Was meint ihr?

 &gt;&gt; Tut mir leid das ich jetzt Pl&#228;ne rausgegeben habe. War
 &gt;&gt; nicht meine Absicht.

 &gt; F&#252;r mich ist das kein Problem - eher tendiere ich sogar lieber dazu,
 &gt; alles zu ver&#246;ffentlichen. Nur mit R&#252;cksicht auf Nils hatte ich das
 &gt; angemerkt. Den Vorschlag, das Layout erst nach ein paar Monaten zu
 &gt; ver&#246;ffentlichen, oder wann immer Nils seinen Break Even erreicht hat,
 &gt; finde ich akzeptabel. W&#228;re schade, wenn er 100 Leiterplatten kauft und
 &gt; irgendjemand parallel dazu eine Sammelbestellung macht oder so.

Vielen Dank f&#252;r so viel R&#252;cksichtnahme!
F&#252;r mich stellt dies eine wichtige Frage dar, da meine Auslagen enorm 
sind. Sie sind jetzt bereits sehr deutlich dreistellig und k&#246;nnten, wenn 
ich tats&#228;chlich die Final Expansion, XS-1541 REV. E und das EasyFlash 
vertreibe schnell vierstellig werden. Das ist schon ein gewaltiges 
Abenteuer, auf das ich mich da einlasse. Wenn ich f&#252;r 50 Baus&#228;tze 
Platinen und Teile einkaufe und davon nur 10 verkaufen kann, weil's 
woanders einen Euro billiger war, habe ich schon ein Problem: 40 x 20,- 
sind mal eben schlappe 800,- Euro.


</PRE>

<!--endarticle-->
    <HR>
    <P><UL>
        <!--threads-->
	<LI>Previous message: <A HREF="000065.html">[EasyFlash-devel] (Layout) Neuer Zwischenstand
</A></li>
	<LI>Next message: <A HREF="000060.html">[EasyFlash-devel] (Layout) Neuer Zwischenstand
</A></li>
         <LI> <B>Messages sorted by:</B> 
              <a href="date.html#69">[ date ]</a>
              <a href="thread.html#69">[ thread ]</a>
              <a href="subject.html#69">[ subject ]</a>
              <a href="author.html#69">[ author ]</a>
         </LI>
       </UL>

<hr>
<a href="https://lists.berlios.de/mailman/listinfo/easyflash-devel">More information about the EasyFlash-devel
mailing list</a><br>
</body></html>
