<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
 <HEAD>
   <TITLE> [EasyFlash-devel] (Layout) Neuer Zwischenstand
   </TITLE>
   <LINK REL="Index" HREF="http://lists.berlios.de/pipermail/easyflash-devel/2009-July/index.html" >
   <LINK REL="made" HREF="mailto:easyflash-devel%40lists.berlios.de?Subject=Re%3A%20%5BEasyFlash-devel%5D%20%28Layout%29%20Neuer%20Zwischenstand&In-Reply-To=%3C20090718232552.234bb601%40akoya%3E">
   <META NAME="robots" CONTENT="index,nofollow">
   <style type="text/css">
       pre {
           white-space: pre-wrap;       /* css-2.1, curent FF, Opera, Safari */
           }
   </style>
   <META http-equiv="Content-Type" content="text/html; charset=us-ascii">
   <LINK REL="Previous"  HREF="000109.html">
   <LINK REL="Next"  HREF="000113.html">
 </HEAD>
 <BODY BGCOLOR="#ffffff">
   <H1>[EasyFlash-devel] (Layout) Neuer Zwischenstand</H1>
    <B>Thomas Giesel</B> 
    <A HREF="mailto:easyflash-devel%40lists.berlios.de?Subject=Re%3A%20%5BEasyFlash-devel%5D%20%28Layout%29%20Neuer%20Zwischenstand&In-Reply-To=%3C20090718232552.234bb601%40akoya%3E"
       TITLE="[EasyFlash-devel] (Layout) Neuer Zwischenstand">skoe at directbox.com
       </A><BR>
    <I>Sat Jul 18 23:25:52 CEST 2009</I>
    <P><UL>
        <LI>Previous message: <A HREF="000109.html">[EasyFlash-devel] (Layout) Neuer Zwischenstand
</A></li>
        <LI>Next message: <A HREF="000113.html">[EasyFlash-devel] (Layout) Neuer Zwischenstand
</A></li>
         <LI> <B>Messages sorted by:</B> 
              <a href="date.html#110">[ date ]</a>
              <a href="thread.html#110">[ thread ]</a>
              <a href="subject.html#110">[ subject ]</a>
              <a href="author.html#110">[ author ]</a>
         </LI>
       </UL>
    <HR>  
<!--beginarticle-->
<PRE>
Hallo,

Man, hier kommt man ja gar nicht mehr hinterher. War heute anderweitig
besch&#228;ftigt und habe einiges aufzuholen... Sieht ja schon richtig super
aus!

Ich schicke erstmal ab, sonst ist alles veraltet, was ich schreibe.


&gt;<i> Und wer ein Modul in den laufenden Rechner steckt ist selber schuld.
</I>
Sehe ich auch so :-)

&gt;<i> Das ist Kupfer, verzinnt ;)
</I>
Cooool. Aber eigentlich geh&#246;rt das sogar vergoldet ;-)

&gt;&gt;<i> In der Zwischenzeit habe ich mich mal der RAM Sache
</I>&gt;&gt;<i> angenommen und die M&#246;glichkeit zwischen 6264 und 6116 w&#228;hlen zu
</I>&gt;&gt;<i> k&#246;nnen implementiert.  
</I>&gt;<i> Prima, mir gef&#228;llt es, ich hoffe Thomas auch.
</I>
Ja, anscheinend war es wirklich ohne zu gro&#223;e Verrenkungen m&#246;glich.

&gt;<i> f&#252;r den Schalter w&#252;rde ich vorschlagen
</I>&gt;<i> einfach nur die L&#246;tpads zu lassen, dann kann jeder selbst entscheiden
</I>&gt;<i> was f&#252;r ein Schalter oder Jumper oder Reed-Kontakt angeschlossen wird.
</I>
Wenn Du noch so nett w&#228;rst, ein drittes Pad danebenzupacken, auch in
100 mil Abstand, w&#252;rde der besagte Schalter schon passen. Und wenn Du
ihn rechts neben den PLCC packen k&#246;nntest, die Pads im gleichen Abstand
vom Platinenrand wie die beiden gro&#223;en vom Taster, passt er perfekt mit
in's Geh&#228;use. Na komm schon, tu einem Software-Entwickler, der den
Schalter &#246;fters mal brauchen k&#246;nnte, den kleinen Gefallen :-) Das
Geh&#228;use des Schalters ist ca. 9 mm lang und l&#228;ge dann am Rand der
Platine, d&#252;rfte also mit nicht den Bauteilen kollidieren. Evtl. Muss
der Taster noch 1 bis 2 mm weiter zur Ecke. Und wer den Schalter nicht
braucht, best&#252;ckt ihn halt nicht oder macht nen Jumper drauf.

Da Logo k&#246;nnte ja dann da hin, wo der Jumper jetzt ist.

&gt;<i> Ja, das ist gut. Ich hoffe, die Nase zum Tasten ist mit 8,35 mm noch 
</I>&gt;<i> lang genug, da&#223; sie rausguckt, aber kurz genug, da&#223; sie aus Versehen 
</I>&gt;<i> bet&#228;tigt werden kann.
</I>
Vermutlich wird sie 4 bis 5 mm rausgucken. Das ist akzeptabel, glaub
ich. Bin aber auch mal gespannt, leider hatte ich gerade keinen Grund,
was bei Reichelt zu bestellen, deshalb habe ich die Taster nur auf dem
Foto und in den Zeichnungen gesehen.

&gt;<i> @Thomas: kannst Du mir eine etwas besser aufgel&#246;ste Version von dem
</I>&gt;<i> Logo geben?
</I>
Habe ich selbst nicht. Der Grafiker ist anscheinend leider momentan mit
was anderem besch&#228;ftigt. Ich habe gerade angefangen, dass mal als
Vektorgrafik nachzuzeichnen, daraus k&#246;nnte man dann alles andere
generieren. Aber Du hast Dir ja schon zu helfen gewusst.

/Thomas


</PRE>

<!--endarticle-->
    <HR>
    <P><UL>
        <!--threads-->
	<LI>Previous message: <A HREF="000109.html">[EasyFlash-devel] (Layout) Neuer Zwischenstand
</A></li>
	<LI>Next message: <A HREF="000113.html">[EasyFlash-devel] (Layout) Neuer Zwischenstand
</A></li>
         <LI> <B>Messages sorted by:</B> 
              <a href="date.html#110">[ date ]</a>
              <a href="thread.html#110">[ thread ]</a>
              <a href="subject.html#110">[ subject ]</a>
              <a href="author.html#110">[ author ]</a>
         </LI>
       </UL>

<hr>
<a href="https://lists.berlios.de/mailman/listinfo/easyflash-devel">More information about the EasyFlash-devel
mailing list</a><br>
</body></html>
