<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
 <HEAD>
   <TITLE> [EasyFlash-devel] Alternatives RAM im Layout
   </TITLE>
   <LINK REL="Index" HREF="http://lists.berlios.de/pipermail/easyflash-devel/2009-July/index.html" >
   <LINK REL="made" HREF="mailto:easyflash-devel%40lists.berlios.de?Subject=Re%3A%20%5BEasyFlash-devel%5D%20Alternatives%20RAM%20im%20Layout&In-Reply-To=%3C004201ca07d2%2441acca10%246800a8c0%40mhv.webmade.com%3E">
   <META NAME="robots" CONTENT="index,nofollow">
   <style type="text/css">
       pre {
           white-space: pre-wrap;       /* css-2.1, curent FF, Opera, Safari */
           }
   </style>
   <META http-equiv="Content-Type" content="text/html; charset=us-ascii">
   <LINK REL="Previous"  HREF="000100.html">
   <LINK REL="Next"  HREF="000103.html">
 </HEAD>
 <BODY BGCOLOR="#ffffff">
   <H1>[EasyFlash-devel] Alternatives RAM im Layout</H1>
    <B>Hoffmann-Vetter, Martin</B> 
    <A HREF="mailto:easyflash-devel%40lists.berlios.de?Subject=Re%3A%20%5BEasyFlash-devel%5D%20Alternatives%20RAM%20im%20Layout&In-Reply-To=%3C004201ca07d2%2441acca10%246800a8c0%40mhv.webmade.com%3E"
       TITLE="[EasyFlash-devel] Alternatives RAM im Layout">martinHV at arcor.de
       </A><BR>
    <I>Sat Jul 18 20:04:54 CEST 2009</I>
    <P><UL>
        <LI>Previous message: <A HREF="000100.html">[EasyFlash-devel] Alternatives RAM im Layout
</A></li>
        <LI>Next message: <A HREF="000103.html">[EasyFlash-devel] Alternatives RAM im Layout
</A></li>
         <LI> <B>Messages sorted by:</B> 
              <a href="date.html#101">[ date ]</a>
              <a href="thread.html#101">[ thread ]</a>
              <a href="subject.html#101">[ subject ]</a>
              <a href="author.html#101">[ author ]</a>
         </LI>
       </UL>
    <HR>  
<!--beginarticle-->
<PRE>Hallo Bj&#246;rn,

&gt;<i> Ich habe jetzt die Drahtbr&#252;cke drin und auch C8 / R3 optimiert.
</I>
Prima, C4 erf&#252;llt damit voll seine Funktion. Leider fehlt noch die &quot;kurze&quot; Verbindung zu C3. Und C6 darf nat&#252;rlich nicht &#252;ber die Br&#252;cke angeschossen werden. Sch&#246;n w&#228;re eben auch, wenn er etwas nach rechts (neben U5) rutschen kann.

&gt;<i> Wie w&#228;re es dann gleich mit einer 3-Fach L&#246;tbr&#252;cke?
</I>
Auch nicht schlecht. Dann vergi&#223;t man nicht die bestehende Br&#252;cke zu durch trennen. Ich w&#252;rde fast dazu tendieren. Eine Lotbr&#252;cke, wo bereits 6264 vorgegeben ist. So hatte Commodore das fr&#252;her auch gemacht!

&gt;<i> &#220;ber die Sache mit der Ramkonfiguration habe ich nochmal nachgedacht:
</I>&gt;<i> 
</I>&gt;<i> Da die Leute eh das ding selberl&#246;ten m&#252;ssen k&#246;nnen die auch selbst
</I>&gt;<i> entscheiden ob da jetzt eine Pinleiste reinkommt. Eine Drahtbr&#252;cke
</I>&gt;<i> tuts genauso.
</I>
Das Problem was ich nur sehe ist, da&#223; in der Standard-Konfiguration, wie Nils das als Bausatz anbieten m&#246;chte, eben jetzt eine zus&#228;tzliche Drahtbr&#252;cke eingel&#246;tet werden mu&#223;. Da w&#228;re eine Lotbr&#252;cke, welche schon eine Verbindung f&#252;r den 6264 rat hilfreicher. Die Platine h&#228;tte _keine_ Nachteile gegen&#252;ber vorher, aber den zus&#228;tzlichen Vorteil, da&#223; eben auch ein 6116 m&#246;glich ist. Diese M&#246;glichkeit ist durch auftrennen einer Leiterbahn (mittels Messer) und l&#246;ten einer Br&#252;cke machbar!

&gt;<i> Die Dallas RTC&#180;s gibt es doch schon nicht mehr zu kaufen oder? Und
</I>&gt;<i> Restposten w&#252;rde ich nicht nehmen weil die interne Batterie dann
</I>&gt;<i> warscheinlich schon leer ist...
</I>
Die kann man bestimmt auch geschickt tauschen. So wie die RTCs bei den SUNs?

&gt;<i> Sind die denn Pinkompatibel?
</I>
Soweit ich wei&#223; ja. M&#252;&#223;te aber selbst Datenbl&#228;tter w&#228;lzen. Ich meine mich aber zu erinnern, da&#223; genau das fr&#252;her das Verkaufsargument war: RAM raus, RTC/RAM rein. Und dann gab's da noch ein etwas kryptische Software-Ansteuerung f&#252;r den RTC. Wobei das evtl. sogar das OK-Kriterium sein k&#246;nnte, da wir nicht alle Adre&#223;leitungen im Zugriff haben.

&gt;<i> ...sollte Thomas entscheiden ob er das Feature wirklich haben will.
</I>
Ja, sollte er.

Gru&#223; Martin

P.S.: Ich hatte mit Absicht den Betreff ge&#228;ndert. Bitte poste reine Layout&#228;nderungen entweder unter einem neuen Betreff oder aber unter dem alten. Dann bleibt dieser Tread ein wenig &#252;berschaubar und sauber!


</PRE>

<!--endarticle-->
    <HR>
    <P><UL>
        <!--threads-->
	<LI>Previous message: <A HREF="000100.html">[EasyFlash-devel] Alternatives RAM im Layout
</A></li>
	<LI>Next message: <A HREF="000103.html">[EasyFlash-devel] Alternatives RAM im Layout
</A></li>
         <LI> <B>Messages sorted by:</B> 
              <a href="date.html#101">[ date ]</a>
              <a href="thread.html#101">[ thread ]</a>
              <a href="subject.html#101">[ subject ]</a>
              <a href="author.html#101">[ author ]</a>
         </LI>
       </UL>

<hr>
<a href="https://lists.berlios.de/mailman/listinfo/easyflash-devel">More information about the EasyFlash-devel
mailing list</a><br>
</body></html>
