<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
 <HEAD>
   <TITLE> [EasyFlash-devel] EasyFlash Beta-Test
   </TITLE>
   <LINK REL="Index" HREF="http://lists.berlios.de/pipermail/easyflash-devel/2009-July/index.html" >
   <LINK REL="made" HREF="mailto:easyflash-devel%40lists.berlios.de?Subject=Re%3A%20%5BEasyFlash-devel%5D%20EasyFlash%20Beta-Test&In-Reply-To=%3C0F8C07D907170F231CA9%40directbox.com%3E">
   <META NAME="robots" CONTENT="index,nofollow">
   <style type="text/css">
       pre {
           white-space: pre-wrap;       /* css-2.1, curent FF, Opera, Safari */
           }
   </style>
   <META http-equiv="Content-Type" content="text/html; charset=us-ascii">
   <LINK REL="Previous"  HREF="000224.html">
   <LINK REL="Next"  HREF="000219.html">
 </HEAD>
 <BODY BGCOLOR="#ffffff">
   <H1>[EasyFlash-devel] EasyFlash Beta-Test</H1>
    <B>Thomas Giesel</B> 
    <A HREF="mailto:easyflash-devel%40lists.berlios.de?Subject=Re%3A%20%5BEasyFlash-devel%5D%20EasyFlash%20Beta-Test&In-Reply-To=%3C0F8C07D907170F231CA9%40directbox.com%3E"
       TITLE="[EasyFlash-devel] EasyFlash Beta-Test">skoe at directbox.com
       </A><BR>
    <I>Thu Jul 23 17:35:28 CEST 2009</I>
    <P><UL>
        <LI>Previous message: <A HREF="000224.html">[EasyFlash-devel] EasyFlash in Emulatoren und offizieller	CRT-Typ
</A></li>
        <LI>Next message: <A HREF="000219.html">[EasyFlash-devel] EasyFlash Beta-Test
</A></li>
         <LI> <B>Messages sorted by:</B> 
              <a href="date.html#217">[ date ]</a>
              <a href="thread.html#217">[ thread ]</a>
              <a href="subject.html#217">[ subject ]</a>
              <a href="author.html#217">[ author ]</a>
         </LI>
       </UL>
    <HR>  
<!--beginarticle-->
<PRE>
Hi,

&gt;<i> eine Nacht dr&#252;ber geschlafen, sieht die Welt wieder anders aus :-)
</I>
Sch&#246;n :-) Wir haben halt alle mal unsere Tiefpunkte. Bei der Hardware-Entwicklung, die f&#252;r mich kein Heimspiel ist, wollte ich auch schon bei den vielen R&#252;ckschl&#228;gen hinwerfen, aber da hatte HofMar oft die rettende Idee.

&gt;<i> Oder sind gar schon alle 10 verplant?
</I>
Das kann durchaus sein. 

Also ich m&#246;chte eine Platine f&#252;r mich und eine reserviere ich f&#252;r Enthusi, der im Urlaub ist.
Alex, Enthusi und HofMar w&#252;rde ich gern die Bauteile spendieren, weil ich noch ein paar S&#228;tze habe und sie sonst nicht brauche. Alex hatte ich damals sogar ein ganzes Modul versprochen, Martin wohnt auch in Berlin und ich k&#246;nnte sie ihm portofrei in die Hand dr&#252;cken und Enthusi will ich damit bestechen :-] Ich hoffe, Bj&#246;rn und Nils sind jetzt nicht sauer dass ich die anderen genannt habe, aber so viele Bauteile habe ich auch nicht. Mhh, den Resettaster habe ich gar nicht.

So, wir w&#228;ren dann (zuf&#228;llige Reihenfolge) Alex, Martin, Bj&#246;rn, Nils (Probeaufbau), Subzero, Enthusi, ich. x1541 sollten wir auch fragen und bevorzugen, falls er das Ding doch als Diagnosemodul verwenden m&#246;chte.

Dann blieben zwei &#252;brig. F&#252;r die w&#252;rde ich im Forum anfragen, wenn wir uns hier einig sind. Es sollten Leute sein, die viele verschiedene Rechner testen k&#246;nnen und es auch tun (SX64, C128, C64 in den verschiedensten Varianten, MAX/VC-10?) 

Habe ich mich verrechnet? Jemanden vergessen? Vielleicht w&#228;re es sogar besser, wenn Du selbst im Forum fragst, wegen Gewerbe und so?

&gt;<i> Preise gab's ja schon.
</I>
Kannst Du die nochmal kurz nennen? Falls Du was in's Forum schreibst, werde ich's ja da sehen.

Nils, ein Geh&#228;use f&#252;r den Probeaufbau kann ich Dir zukommen lassen. Kannst mir daf&#252;r gern das Porto f&#252;r meine erste Bestellung erlassen ;-)

Gru&#223;,

Thomas



</PRE>

<!--endarticle-->
    <HR>
    <P><UL>
        <!--threads-->
	<LI>Previous message: <A HREF="000224.html">[EasyFlash-devel] EasyFlash in Emulatoren und offizieller	CRT-Typ
</A></li>
	<LI>Next message: <A HREF="000219.html">[EasyFlash-devel] EasyFlash Beta-Test
</A></li>
         <LI> <B>Messages sorted by:</B> 
              <a href="date.html#217">[ date ]</a>
              <a href="thread.html#217">[ thread ]</a>
              <a href="subject.html#217">[ subject ]</a>
              <a href="author.html#217">[ author ]</a>
         </LI>
       </UL>

<hr>
<a href="https://lists.berlios.de/mailman/listinfo/easyflash-devel">More information about the EasyFlash-devel
mailing list</a><br>
</body></html>
