<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
 <HEAD>
   <TITLE> [EasyFlash-devel] EasyFlash Beta-Test
   </TITLE>
   <LINK REL="Index" HREF="http://lists.berlios.de/pipermail/easyflash-devel/2009-July/index.html" >
   <LINK REL="made" HREF="mailto:easyflash-devel%40lists.berlios.de?Subject=Re%3A%20%5BEasyFlash-devel%5D%20EasyFlash%20Beta-Test&In-Reply-To=%3C4A6BB487.7040205%40gmx.de%3E">
   <META NAME="robots" CONTENT="index,nofollow">
   <style type="text/css">
       pre {
           white-space: pre-wrap;       /* css-2.1, curent FF, Opera, Safari */
           }
   </style>
   <META http-equiv="Content-Type" content="text/html; charset=us-ascii">
   <LINK REL="Previous"  HREF="000225.html">
   <LINK REL="Next"  HREF="000229.html">
 </HEAD>
 <BODY BGCOLOR="#ffffff">
   <H1>[EasyFlash-devel] EasyFlash Beta-Test</H1>
    <B>Nils Eilers</B> 
    <A HREF="mailto:easyflash-devel%40lists.berlios.de?Subject=Re%3A%20%5BEasyFlash-devel%5D%20EasyFlash%20Beta-Test&In-Reply-To=%3C4A6BB487.7040205%40gmx.de%3E"
       TITLE="[EasyFlash-devel] EasyFlash Beta-Test">nils.eilers at gmx.de
       </A><BR>
    <I>Sun Jul 26 03:42:31 CEST 2009</I>
    <P><UL>
        <LI>Previous message: <A HREF="000225.html">[EasyFlash-devel] EasyFlash Beta-Test
</A></li>
        <LI>Next message: <A HREF="000229.html">[EasyFlash-devel] EasyFlash Beta-Test
</A></li>
         <LI> <B>Messages sorted by:</B> 
              <a href="date.html#228">[ date ]</a>
              <a href="thread.html#228">[ thread ]</a>
              <a href="subject.html#228">[ subject ]</a>
              <a href="author.html#228">[ author ]</a>
         </LI>
       </UL>
    <HR>  
<!--beginarticle-->
<PRE>&gt;<i> Wenn ich mir die Tabelle so richtig ansehe, dann bekommt man f&#252;r 23,20 EUR
</I>&gt;<i> mehr die doppelte Anzahl Platinen. Ich w&#252;rde daher fast dazu &#252;bergehen, die
</I>&gt;<i> Anzahl der Prototypen auf 20 zu erh&#246;hen. 
</I>Das hat in der Tat eine Reihe Vorteile. Wegen mir gerne!

&gt;<i> Es sollte nur vor der Auslieferung ein umfangreicher Test an der ersten
</I>&gt;<i> Platine durchgef&#252;hrt werden.
</I>Dazu k&#246;nnen wir besprechen, wem ich wann was zuschicken soll - dann 
w&#252;rde ich ggfs. die restlichen Platinen selbst vor dem weiteren Versand 
modifizieren.

&gt;<i> Nach meiner Rechnung sind das aber 20,30 EUR!
</I>&gt;<i> Auch hier komme ich auf 25,40
</I>Wer rechnen kann, ist klar im Vorteil. Sollte ich ein ernstes Wort mit 
meinen Nixie-Tischrechner reden m&#252;ssen? Heute hat er's jedenfalls direkt 
eingesehen.
5,50 EUR Platine
9,40 EUR Teile
-----------
14,90 EUR Easyflash Bausatz ohne Geh&#228;use zzgl. Porto
Dann wird eben an den Sockel gespart (billig-Variante mit doppeltem 
Federkontakt)


&gt;<i> Das halte ich auch f&#252;r sehr wichtig. Evtl. k&#246;nnte man noch dr&#252;ber nachdenke,
</I>&gt;<i> ein (fast) fertig zusammengebautes Modul anzubieten. Ich habe mal gelesen,
</I>&gt;<i> wenn das (fast) Fertigger&#228;t auch nicht ohne weiteren Eingriff betriebsbereit
</I>&gt;<i> ist, dann fa&#223;t die Recycling-Regelung auch nicht. Daher kann man das Modul
</I>&gt;<i> auch mit allen Fassungen und Bauteilen verl&#246;ten und w&#252;rde die passenden ICs
</I>&gt;<i> einfach gesondert beilegen. Dann ist das ein Bausatz, den auch Leute ohne
</I>&gt;<i> L&#246;terfahrung &quot;zusammenstecken&quot; k&#246;nnen. Ob das wirklich so funktioniert,
</I>&gt;<i> sollte man sich noch einmal rechtlich zusichern lassen.
</I>Das rechtlich &quot;zusichern&quot; ist leider leichter gesagt, als getan. 
Garantieren wird einem da wahrscheinlich keiner was. Irgendwo habe ich 
eine Mail gefunden, wo jemand &#252;ber einen Kontakt bei der Beh&#246;rde 
angefragt hat, wie sie das denn im Zweifelsfall halten w&#252;rden - da hie&#223; 
es, Baus&#228;tze w&#252;rden generell auch wie Fertigger&#228;te gehandhabt, es sei 
denn, es bedarf eines &quot;Fachmanns&quot;, um diesen Bausatz in ein Fertigger&#228;t 
zu verwandeln. Die Definiton &quot;Fachmann&quot; ist aber nat&#252;rlich nicht weiter 
dargelegt worden und liegt im Zweifelsfall im ber&#252;hmten 
&quot;Ermessensspielraum&quot;.

Nun gibt es zwei Varianten:

a) man liefert mit Sockeln best&#252;ckte Module nebst Chips aus, mit fettem 
Warnhinweis, dass die Platine nur durch einen &quot;Fachmann&quot; mit den Chips 
best&#252;ckt werden darf und einem Plan, welcher Chip wo hin kommt. Der Frau 
  von der Wursttheke im Supermarkt dr&#252;ckt man dann ein unbest&#252;cktes 
Easyflash in die Hand und nimmt sie als Referenz, dass es tats&#228;chlich 
eines Fachmannes bedarf, die Platine in ein Fertigger&#228;t zu verwandeln.

b) Man unterstellt, dass auch Kinder in h&#246;heren Grundschulklassen in der 
Lage sind, bezeichnete Teile nach schriftlicher Anleitung in die L&#246;cher 
eines Sockels zu stecken.

Wahrscheinlich ist beides wahr. Ich wei&#223; nicht, wie das ausgehen wird...


</PRE>

<!--endarticle-->
    <HR>
    <P><UL>
        <!--threads-->
	<LI>Previous message: <A HREF="000225.html">[EasyFlash-devel] EasyFlash Beta-Test
</A></li>
	<LI>Next message: <A HREF="000229.html">[EasyFlash-devel] EasyFlash Beta-Test
</A></li>
         <LI> <B>Messages sorted by:</B> 
              <a href="date.html#228">[ date ]</a>
              <a href="thread.html#228">[ thread ]</a>
              <a href="subject.html#228">[ subject ]</a>
              <a href="author.html#228">[ author ]</a>
         </LI>
       </UL>

<hr>
<a href="https://lists.berlios.de/mailman/listinfo/easyflash-devel">More information about the EasyFlash-devel
mailing list</a><br>
</body></html>
