<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
 <HEAD>
   <TITLE> [EasyFlash-devel] EasyFlash Beta-Test
   </TITLE>
   <LINK REL="Index" HREF="http://lists.berlios.de/pipermail/easyflash-devel/2009-July/index.html" >
   <LINK REL="made" HREF="mailto:easyflash-devel%40lists.berlios.de?Subject=Re%3A%20%5BEasyFlash-devel%5D%20EasyFlash%20Beta-Test&In-Reply-To=%3C5AA66BC73FB2468A9B92EAF92A19B687%40dell%3E">
   <META NAME="robots" CONTENT="index,nofollow">
   <style type="text/css">
       pre {
           white-space: pre-wrap;       /* css-2.1, curent FF, Opera, Safari */
           }
   </style>
   <META http-equiv="Content-Type" content="text/html; charset=us-ascii">
   <LINK REL="Previous"  HREF="000209.html">
   <LINK REL="Next"  HREF="000225.html">
 </HEAD>
 <BODY BGCOLOR="#ffffff">
   <H1>[EasyFlash-devel] EasyFlash Beta-Test</H1>
    <B>s</B> 
    <A HREF="mailto:easyflash-devel%40lists.berlios.de?Subject=Re%3A%20%5BEasyFlash-devel%5D%20EasyFlash%20Beta-Test&In-Reply-To=%3C5AA66BC73FB2468A9B92EAF92A19B687%40dell%3E"
       TITLE="[EasyFlash-devel] EasyFlash Beta-Test">subzero1 at web.de
       </A><BR>
    <I>Wed Jul 22 20:29:32 CEST 2009</I>
    <P><UL>
        <LI>Previous message: <A HREF="000209.html">[EasyFlash-devel] EasyFlash Beta-Test
</A></li>
        <LI>Next message: <A HREF="000225.html">[EasyFlash-devel] EasyFlash Beta-Test
</A></li>
         <LI> <B>Messages sorted by:</B> 
              <a href="date.html#211">[ date ]</a>
              <a href="thread.html#211">[ thread ]</a>
              <a href="subject.html#211">[ subject ]</a>
              <a href="author.html#211">[ author ]</a>
         </LI>
       </UL>
    <HR>  
<!--beginarticle-->
<PRE>hi niels,
tut mir leid wenn ich hier was angefacht habe was ich wirklich nicht wollte.
ich stehe ganz hinter deiner aufstellung und rechnung und bitte dich 
durchzuhalten und mein verhalten zu entschuldigen. meine absichten waren 
andere, aber alles aus einer hand (deiner) incl. deiner zeit und &quot;nerven&quot; 
:<i>-) finde ich lobenswert.
</I>ich wusste wirklich net das du es ja kommerziell (komisches wort, aber meine 
es nicht im negativen) machst und es nat&#252;rlich &#252;ber deinen weg VIEL VIEL 
professioneller ist.
gruss sven
(p.s. ich hoffe ich darf bei dir noch bestellen?)


----- Original Message ----- 
From: &quot;Nils Eilers&quot; &lt;<A HREF="https://lists.berlios.de/mailman/listinfo/easyflash-devel">nils.eilers at gmx.de</A>&gt;
To: &lt;<A HREF="https://lists.berlios.de/mailman/listinfo/easyflash-devel">easyflash-devel at lists.berlios.de</A>&gt;
Sent: Wednesday, July 22, 2009 8:14 PM
Subject: Re: [EasyFlash-devel] EasyFlash Beta-Test


&gt;<i> aber wenn wir 10 platinen a 15 eu = 150 eu aber von #### zu genau dem
</I>&gt;<i> preis (ca.) 60 bekommen - warum nicht die nehmen?
</I>&gt;<i> (also vorausgesetzt das technisch alles so ist, wie gewollt)
</I>&gt;<i> wenns klappt hat nils 50 platinen die er &quot;offiziell&quot; an die besteller
</I>&gt;<i> verschenkt und dafuer (sagen wir mal) 3 euro mehr fuer &quot;porto&quot;
</I>&gt;<i> verlangt = guenstig fuer alle
</I>
Prima Vorschlag! Ich freue mich schon auf die Anfragen, ob ich nicht
auch noch XS-1541 und Final Expansion-Platinen verschenken kann.

Des weiteren ist das Umlegen von Kosten wie PayPal oder hier gar ganze
Platinen auf Portokosten nicht zul&#228;ssig und kann ohne weiteres
erfolgreich abgemahnt werden - auch wenn man das in kleinen Shops immer
wieder sieht, dass z.B. PayPal-Geb&#252;hren auf das Porto umgelegt werden.

Ich bin wirklich kurz davor, hinzuschmeissen und zu sagen: macht Euern
Kram alleine. Ich verschleudere so oder so meine Zeit, um etwas
aufzubauen und den Leuten etwas Gutes mit Hand und Fu&#223; zu bieten. Das
hat schon sehr viel mit Idealismus zu tun, wie man weiter unten sehen kann.
Jetzt alles zerbr&#246;seln zu lassen, damit Einzelne drei Euro sparen
k&#246;nnen, f&#252;r den Preis, dass jeder Einzelne Stunden mehr Arbeit hat, kann
nicht im Interesse des Easyflashs sein.

Wenn sich niemand anderes findet, der bereit ist, Sammelbestellungen
oder was auch immer auf sich zu nehmen, bedeutet das, das jeder auf sich
selbst gestellt ist.

Ich habe das mal spa&#223;eshalber durchgerechnet:

- Platine inkl. unversicherter Versand 4,00 EUR
- Teile von Kessler (Kessler kennt keine Warenk&#246;rbe, viel Spa&#223; beim
bestellen...) 8,45 EUR
- Versandkosten Kessler 4,95
----------------------------
ist man in Summe bei 13,40 EUR f&#252;r ein EasyFlash ohne Geh&#228;use

Nimmt man ein Geh&#228;use von Vesalia, ist der Versand teurer als das Modul:
4,49 EUR Modulgeh&#228;use
5,80 EUR Versandkosten
--------------
10,29 EUR Summe

10,29 Gesamtkosten Geh&#228;use
13,40 Gesamtkosten ohne Geh&#228;use
----------
23,69 EUR Gesamtkosten mit Modulgeh&#228;use

Das w&#228;re der Fall, den ich eben genau nicht wollte: das jeder an
diversen Stellen sich seine Sachen zusammen sammeln darf - aber Zeit
kostet ja hier generell nichts...

Wenn ich eine hochriskante Mischkalkulation mache, die nur dann aufgehen
kann, wenn der Markt nicht mit verschenkten Platinen zugeschmissen wird,
w&#228;re ein Preis von 5,50 EUR pro Platine denkbar - und zwar sowohl f&#252;r
die 10 Prototypen als auch f&#252;r alles, was danach kommt.
Dazu M&#220;SSEN die Prototypen beim selben Hersteller geordert werden, um
wenigstens eine Chance zu haben, beim zweiten mal keine Tooling-Kosten
zu bezahlen.

Ich habe im Anhang eine kleine Excel-Tabelle angeh&#228;ngt, da kann jeder
man selbst mit den Zahlen spielen.

Die Preise sind f&#252;r Platinenauflagen bei Abnahme von 10, 20 und 50
Platinen. Sollten bei Nachbestellungen &#196;nderungen f&#228;llig werden, werden
diese g&#252;nstiger, wenn nur entweder der Best&#252;ckungsdruck oder eine
Kupferlage ge&#228;ndert werden muss. PCBCART weist sie im Online-Rechner mit
0.00 EUR aus, aber das halte ich f&#252;r ein Ger&#252;cht...

Wie auch immer, gehen wir von einer Platine mit vergoldeten Kontakten,
angeschr&#228;gtem Slot und Best&#252;ckungsdruck f&#252;r 5,50 EUR aus:

5,50 EUR Platine
9,90 EUR Teile
4,90 EUR Versichertes Paket (Hermes)
---------
19,90 EUR Easyflash komplett, ohne Modulgeh&#228;use

Das ist 6,50 EUR teurer als 13,40, aber daf&#252;r auch erheblich leichter zu
beschaffen.

Wenn ich Geh&#228;use im Zehnerpack besorge und dann nur einmal Versand
bezahle, macht das 10 x 4,49 + 5,80 = 50,70 EUR, sagen wir 5,10 EUR pro
Geh&#228;use. Das w&#228;ren

5,50 EUR Platine
9,90 EUR Teile
5,10 EUR Geh&#228;use
4,90 EUR Versichertes Paket (Hermes)
---------
25,- EUR Easyflash komplett, mit Modulgeh&#228;use

Auch das w&#228;re teuer als 23,69 -- keine Frage.


Mal den Worst-Case durchgerechnet: ich verkaufe 10 Prototypplatinen f&#252;r
5,50 EUR, die mich 11,27 EUR kosten - dann habe ich die Differenz mal
10, n&#228;mlich 57,77 EUR verloren.
Wir starten einen neuen Anlauf und kommen aber nicht umhin, mehr als nur
eine Kleinigkeit zu &#228;ndern: es werden neue Tooling-Kosten f&#228;llig.
Ich verkaufe weitere 10 Prototypplatinen f&#252;r 5,50 EUR, die mich 11,27
EUR kosten - dann habe ich die Differenz mal 10, n&#228;mlich 57,77 EUR
verloren und liege mit den 57,77 EUR vom letzten mal jetzt bei 115,54 EUR.
Wenn es nach dem zweiten mal passt und keine weiteren Tooling-Kosten
f&#228;llig werden, w&#252;rde mich eine Platine bei Abnahme von 50 St&#252;ck 3,55 EUR
kosten. Verkaufe ich sie f&#252;r 5,50 habe ich an einer 5,50 - 3,55 = 1,95
EUR, an allen 50 x 1,95 = 97,50 EUR reingeholt.

Das bedeutet also:

+ passt es auf Anhieb, mache ich 97,50 EUR - 57,77 EUR = 39,73 EUR gut,
wenn ich insgesamt 60 Easyflash verkauft habe. Selbst ein
Ein-Euro-Jobber hat einen effektiv h&#246;heren Stundenlohn...
+ passt es im zweiten Anlauf, habe ich nach 70 verkauften
Prototypplatinen noch einen Verlust von 2 * 57,77 - 97,50 = 18,04 EUR -- 
  das ist &#252;berschaubar, aber 70 EasyFlash wollen auch erst einmal
verkauft werden.

Das passt zu meiner Philosophie, die Baus&#228;tze st&#228;ndig und dauerhaft
anbieten zu wollen: ein paar Euro bringen sie bestenfalls auf einer
l&#228;ngeren Zeitachse. Das bedeutet aber auch, dass man die Dinger da so
lange &quot;mal eben&quot; bestellen kann und niemand hinter her rennen muss, ob
es da noch Platinen und hier noch Teile (und welche?) gibt.

Man mu&#223; sich aber schon entscheiden: m&#246;chte man es professionell (und
damit unvermeidlich gewerblich) oder underground-m&#228;ssig haben.
Professionelle Qualit&#228;t zu Underground-Preisen geht nicht.


_______________________________________________
EasyFlash-devel mailing list
<A HREF="https://lists.berlios.de/mailman/listinfo/easyflash-devel">EasyFlash-devel at lists.berlios.de</A>
<A HREF="https://lists.berlios.de/mailman/listinfo/easyflash-devel">https://lists.berlios.de/mailman/listinfo/easyflash-devel</A> 


</PRE>

<!--endarticle-->
    <HR>
    <P><UL>
        <!--threads-->
	<LI>Previous message: <A HREF="000209.html">[EasyFlash-devel] EasyFlash Beta-Test
</A></li>
	<LI>Next message: <A HREF="000225.html">[EasyFlash-devel] EasyFlash Beta-Test
</A></li>
         <LI> <B>Messages sorted by:</B> 
              <a href="date.html#211">[ date ]</a>
              <a href="thread.html#211">[ thread ]</a>
              <a href="subject.html#211">[ subject ]</a>
              <a href="author.html#211">[ author ]</a>
         </LI>
       </UL>

<hr>
<a href="https://lists.berlios.de/mailman/listinfo/easyflash-devel">More information about the EasyFlash-devel
mailing list</a><br>
</body></html>
